<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"3f66a670d6feeeaa00a90aa6c14984040b2ebf55e1ea7dc00dd6674582c24d75","plan_job_ref":"Job Terraform plan #33 at https://github.com/GSA-TTS/FAC/actions/runs/4378325027","plan_hash":"bd32bab04b870e1d32b322ceb3ae0e4d7739a0b08e90d0cbc729018d6908a567","plan_text_format":"text","version":"1.33.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.production.module.clamav.cloudfoundry_app.clamav_api will be created
  + resource "cloudfoundry_app" "clamav_api" {
      + buildpack                  = (known after apply)
      + disk_quota                 = 2048
      + docker_image               = "ajilaag/clamav-rest:20230228"
      + enable_ssh                 = (known after apply)
      + environment                = (sensitive value)
      + health_check_http_endpoint = (known after apply)
      + health_check_timeout       = (known after apply)
      + health_check_type          = "port"
      + id                         = (known after apply)
      + id_bg                      = (known after apply)
      + instances                  = (known after apply)
      + memory                     = 3072
      + name                       = "fac-av-production"
      + ports                      = (known after apply)
      + space                      = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
      + stack                      = (known after apply)
      + stopped                    = false
      + strategy                   = "none"
      + timeout                    = 600

      + routes {
          + port  = (known after apply)
          + route = (known after apply)
        }
    }

  # module.production.module.clamav.cloudfoundry_network_policy.clamav_routing will be created
  + resource "cloudfoundry_network_policy" "clamav_routing" {
      + id = (known after apply)

      + policy {
          + destination_app = (known after apply)
          + port            = "61443"
          + protocol        = "tcp"
          + source_app      = "5dac166f-2fb0-4e72-8d4d-4359191bf284"
        }
    }

  # module.production.module.clamav.cloudfoundry_route.clamav_route will be created
  + resource "cloudfoundry_route" "clamav_route" {
      + domain   = "26df58ef-0c0d-4997-b68b-8defb7b3998b"
      + endpoint = (known after apply)
      + hostname = "fac-av-production"
      + id       = (known after apply)
      + port     = (known after apply)
      + space    = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #33](https://github.com/GSA-TTS/FAC/actions/runs/4378325027)